""" Написати функцію, яка буде реалізувати логіку циклічного зсуву
елементів в списку. Тобто, функція приймає два аргументи: список і
величину зсуву (якщо ця величина додатня - пересуваємо з кінця на початок,
якщо від'ємна - навпаки - пересуваємо елементи з початку списку в його кінець).
   Наприклад:
       fnc([1, 2, 3, 4, 5], shift=1) --> [5, 1, 2, 3, 4]
       fnc([1, 2, 3, 4, 5], shift=-2) --> [3, 4, 5, 1, 2]
"""


def elem_shift(user_list, shift):
    if shift == 0:
        return user_list
    elif shift < 0:
        shift = abs(shift)
        for i in range(shift):
            # видаляємо перший елемент (.pop(0)) і додаємо його в кінець
            user_list.append(user_list.pop(0))
    else:
        for i in range(shift):
            # видаляємо останній елемент (.pop())
            # і вставляємо його на початку (0-позиція)
            user_list.insert(0, user_list.pop())
    return user_list


print(elem_shift([1, 2, 3, 4, 5], shift=-2))
