""" Користувач вводить змiннi "x" та "y" з довiльними цифровими значеннями;
-  Створiть просту умовну конструкцiю(звiсно вона повинна бути в тiлi ф-цiї),
пiд час виконання якої буде перевiрятися рiвнiсть змiнних "x" та "y"
і при нерiвностi змiнних "х" та "у" вiдповiдь повертали рiзницю чисел.
-  Повиннi опрацювати такi умови:
-  x > y;       вiдповiдь - х бiльше нiж у на z
-  x < y;       вiдповiдь - у бiльше нiж х на z
-  x == y.      вiдповiдь - х дорiвнює z
"""


def diff(x, y):
    if x > y:
        z = x - y
        print(str(x) + " більше ніж " + str(y) + " на " + str(z))
    elif x < y:
        z = y - x
        print(str(y) + " більше ніж " + str(x) + " на " + str(z))
    else:
        print(str(x) + " дорівнює " + str(y))


x, y = map(int, input("Введіть два числа: ").split())
diff(x, y)
